package com.company.lesson5;

/*
Задание11
Создать массив типа double с размером 4. Записать в него любые значения с помощью блока для инициализации.
Вывести на консоль значение первого элемента.
 */
public class Task11 {
    public static void main(String[] args) {
        double[] array = {4.5, 6, 7.3, 4};
        System.out.println(array[0]);
    }
}
